import { Card, CardHeader } from "@/components/ui/card";

const heading2 = "text-xl";
const ulList = "list-disc pl-5 space-y-5";

export default function PrivacyPolicy() {
  return (
    <main className="min-h-screen container mx-auto max-sm:px-5">
      
      {/* Политика на поверителност */}

      <h1 className="text-2xl font-semibold my-5">Политика на поверителност</h1>
      <Card className="mb-5">
        <CardHeader className="space-y-5">
          <p>Дата на последна актуализация: [31.01.2025]</p>
          
          {/* 1. Събиране на информация */}

          <h2 className={heading2}>1. Събиране на информация</h2>
          <p>Ние събираме следните видове информация:</p>
          <ul className={ulList}>
            <li>
              <strong>Лична информация</strong>
              <p>
                име, имейл адрес, телефонен номер, адрес за доставка, информация
                за плащане и друга информация, предоставена при регистрация или
                поръчка.
              </p>
            </li>
            <li>
              <strong>Техническа информация</strong>
              <p>
                IP адрес, тип браузър, операционна система и друга информация,
                събирана чрез бисквитки и подобни технологии.
              </p>
            </li>
            <li>
              <strong>Информация за транзакции</strong>
              <p>
                история на покупките, предпочитания и взаимодействия с нашия
                уебсайт.
              </p>
            </li>
          </ul>
          
          {/* 2. Използване на информацията */}

          <h2 className={heading2}>2. Използване на информацията</h2>
          <p>Събраната информация се използва за следните цели:</p>
          <ul className={ulList}>
            <li>Обработка и изпълнение на поръчки.</li>
            <li>
              Подобряване на потребителското изживяване и функционалността на
              нашия уебсайт.
            </li>
            <li>
              Комуникация с вас относно поръчки, промоции или други важни
              актуализации.
            </li>
            <li>Анализ и подобряване на нашите продукти и услуги.</li>
          </ul>
          
          {/* 3. Споделяне на информация */}

          <h2 className={heading2}>3. Споделяне на информация</h2>
          <p>
            Ние не продаваме, не разменяме и не споделяме вашата лична
            информация с трети страни, освен в следните случаи:
          </p>
          <ul className={ulList}>
            <li>
              <strong>С трети страни доставчици</strong>
              <p>
                за обработка на плащания, доставка или други услуги, свързани с
                поръчки.
              </p>
            </li>
            <li>
              <strong>За правни цели</strong>
              <p>
                когато е необходимо за спазване на законови изисквания, защита
                на правата ни или предотвратяване на измами.
              </p>
            </li>
          </ul>
          
          {/* 4. Бисквитки (Cookies) */}

          <h2 className={heading2}>4. Бисквитки (Cookies)</h2>
          <p>
            Ние използваме бисквитки за събиране на информация и подобряване на
            вашето преживяване на нашия уебсайт. Бисквитките могат да включват:
          </p>
          <ul className={ulList}>
            <li>
              Функционални бисквитки: за осигуряване на базови функции като
              добавяне на продукти в количката.
            </li>
            <li>
              Аналитични бисквитки: за анализ на трафика и поведението на
              потребителите.
            </li>
          </ul>
          <p>
            Можете да управлявате настройките на бисквитките чрез вашия браузър.
          </p>
          
          {/* 5. Сигурност на информацията */}

          <h2 className={heading2}>5. Сигурност на информацията</h2>
          <p>
            Ние предприемаме подходящи технически и организационни мерки за
            защита на вашата лична информация от неоторизиран достъп, загуба или
            злоупотреба.
          </p>
          
          {/* 6. Вашите права */}

          <h2 className={heading2}>6. Вашите права</h2>
          <p>Вие имате право да:</p>
          <ul className={ulList}>
            <li>
              Подадете жалба до компетентния орган за защита на личните данни.
            </li>
          </ul>
          <p>
            За да упражните тези права, моля, свържете се с нас на{" "}
            {process.env.ADMIN_SUPPORT_EMAIL}.
          </p>
          
          {/* 7. Контакти */}

          <h2 className={heading2}>7. Контакти</h2>
          <p>
            Ако имате въпроси или притеснения относно нашата Политика на
            поверителност, моля, свържете се с нас:
          </p>
          <ul className={ulList}>
            <li>
              <strong>Имейл</strong>
              <p>{process.env.ADMIN_SUPPORT_EMAIL}</p>
            </li>
            <li>
              <strong>Телефон</strong>
              <p>{process.env.ADMIN_SUPPORT_PHONE}</p>
            </li>
          </ul>
          <h2 className={heading2}>8. Промени в Политиката на поверителност</h2>
          <p>
            Ние си запазваме правото да променяме тази Политика на поверителност
            по всяко време. Всички промени ще бъдат публикувани на тази
            страница, като датата на последна актуализация ще бъде коригирана.
          </p>
          <p>Благодарим ви, че ни се доверявате!</p>
        </CardHeader>
      </Card>
    </main>
  );
}
